ZigaMahne/STM32U5xx_DFP/CMSIS/SVD/STM32U5G9.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC4">
      <name>SEC_ADC4</name>
	  <disableCondition>DCB-&gt;DSCSR-&gt;CDS == 0</disableCondition>
      <baseAddress>0x56021000</baseAddress>
    </peripheral>
	<peripheral>
      <name>ADF1</name>
      <description>ADF1</description>
      <groupName>ADF</groupName>
      <baseAddress>0x46024000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADF1_FLT0</name>
        <description>ADF1 filter 0 global interrupt</description>
        <value>112</value>
      </interrupt>
      <registers>
        <register>
          <name>ADF_GCR</name>
          <displayName>ADF_GCR</displayName>
          <description>ADF Global Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRGO</name>
              <description>Trigger output control Set by software and reset by</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_CKGCR</name>
          <displayName>ADF_CKGCR</displayName>
          <description>ADF clock generator control register</description>
          <addressOffset>0x004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKGACTIVE</name>
              <description>Clock generator active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PROCDIV</name>
              <description>Divider to control the serial interface clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>CCKDIV</name>
              <description>Divider to control the ADF_CCK clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>Digital filter trigger signal selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRGSENS</name>
              <description>CKGEN trigger sensitivity selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCK1DIR</name>
              <description>ADF_CCK1 direction</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCK0DIR</name>
              <description>ADF_CCK0 direction</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKGMOD</name>
              <description>Clock generator mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCK1EN</name>
              <description>ADF_CCK1 clock enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCK0EN</name>
              <description>ADF_CCK0 clock enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKGDEN</name>
              <description>CKGEN dividers enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_SITF0CR</name>
          <displayName>ADF_SITF0CR</displayName>
          <description>ADF serial interface control register 0</description>
          <addressOffset>0x080</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00001F00</resetValue>
          <fields>
            <field>
              <name>SITFACTIVE</name>
              <description>SITFACTIVE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STH</name>
              <description>STH</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SITFMOD</name>
              <description>SITFMOD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SCKSRC</name>
              <description>SCKSRC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SITFEN</name>
              <description>SITFEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_BSMX0CR</name>
          <displayName>ADF_BSMX0CR</displayName>
          <description>ADF bitstream matrix control register 0</description>
          <addressOffset>0x084</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BSMXACTIVE</name>
              <description>BSMX active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSSEL</name>
              <description>Bitstream selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_DFLT0CR</name>
          <displayName>ADF_DFLT0CR</displayName>
          <description>ADF digital filter control register 0</description>
          <addressOffset>0x088</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFLTACTIVE</name>
              <description>DFLT0 active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLTRUN</name>
              <description>DFLT0 run status flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBDIS</name>
              <description>Number of samples to be discarded</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>DFLT0 trigger signal selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACQMOD</name>
              <description>DFLT0 trigger mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FTH</name>
              <description>RXFIFO threshold selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA requests enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLTEN</name>
              <description>DFLT0 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_DFLT0CICR</name>
          <displayName>ADF_DFLT0CICR</displayName>
          <description>ADF digital filer configuration register 0</description>
          <addressOffset>0x08C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCALE</name>
              <description>Scaling factor selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>MCICD</name>
              <description>CIC decimation ratio selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>CICMOD</name>
              <description>Select the CIC order</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DATSRC</name>
              <description>Source data for the digital filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_DFLT0RSFR</name>
          <displayName>ADF_DFLT0RSFR</displayName>
          <description>ADF reshape filter configuration register 0</description>
          <addressOffset>0x090</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HPFC</name>
              <description>High-pass filter cut-off frequency</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HPFBYP</name>
              <description>High-pass filter bypass</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSFLTD</name>
              <description>Reshaper filter decimation ratio</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSFLTBYP</name>
              <description>Reshaper filter bypass</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_DLY0CR</name>
          <displayName>ADF_DLY0CR</displayName>
          <description>ADF delay control register 0</description>
          <addressOffset>0x0A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SKPBF</name>
              <description>Skip busy flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SKPDLY</name>
              <description>Delay to apply to a bitstream</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_DFLT0IER</name>
          <displayName>ADF_DFLT0IER</displayName>
          <description>ADF DFLT0 interrupt enable register</description>
          <addressOffset>0x0AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDLVLIE</name>
              <description>SAD sound-level value ready enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDDETIE</name>
              <description>Sound activity detection interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFOVRIE</name>
              <description>Reshape filter overrun interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABIE</name>
              <description>Clock absence detection interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SATIE</name>
              <description>Saturation detection interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DOVRIE</name>
              <description>Data overflow interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTHIE</name>
              <description>RXFIFO threshold interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_DFLT0ISR</name>
          <displayName>ADF_DFLT0ISR</displayName>
          <description>ADF DFLT0 interrupt status register 0</description>
          <addressOffset>0x0B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDLVLF</name>
              <description>Sound level value ready flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDDETF</name>
              <description>Sound activity detection flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOVRF</name>
              <description>Reshape filter overrun detection flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKABF</name>
              <description>Clock absence detection flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SATF</name>
              <description>Saturation detection flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNEF</name>
              <description>RXFIFO not empty flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVRF</name>
              <description>Data overflow flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTHF</name>
              <description>RXFIFO threshold flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_SADCR</name>
          <displayName>ADF_SADCR</displayName>
          <description>ADF SAD control register</description>
          <addressOffset>0x0B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SADACTIVE</name>
              <description>SAD Active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SADMOD</name>
              <description>SAD working mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRSIZE</name>
              <description>Frame size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYSTEN</name>
              <description>Hysteresis enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SADST</name>
              <description>SAD state</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DETCFG</name>
              <description>Sound trigger event configuration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATCAP</name>
              <description>Data capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SADEN</name>
              <description>Sound activity detector enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_SADCFGR</name>
          <displayName>ADF_SADCFGR</displayName>
          <description>ADF SAD configuration register</description>
          <addressOffset>0x0BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ANMIN</name>
              <description>ANMIN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>HGOVR</name>
              <description>Hangover time window</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LFRNB</name>
              <description>LFRNB</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ANSLP</name>
              <description>ANSLP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SNTHR</name>
              <description>SNTHR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_SADSDLVR</name>
          <displayName>ADF_SADSDLVR</displayName>
          <description>ADF SAD sound level register</description>
          <addressOffset>0x0C0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDLVL</name>
              <description>SDLVL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_SADANLVR</name>
          <displayName>ADF_SADANLVR</displayName>
          <description>ADF SAD ambient noise level register</description>
          <addressOffset>0x0C4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ANLVL</name>
              <description>ANLVL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_DFLT0DR</name>
          <displayName>ADF_DFLT0DR</displayName>
          <description>ADF digital filter data register 0</description>
          <addressOffset>0x0F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>DR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
