ZigaMahne/STM32U5xx_DFP/CMSIS/SVD/STM32U5G9.svd
          <register>
            <name>GFXMMU_LUT285H</name>
            <displayName>GFXMMU_LUT285H</displayName>
            <description>GFXMMU LUT entry 285 high</description>
            <addressOffset>0x18ec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT286L</name>
            <displayName>GFXMMU_LUT286L</displayName>
            <description>GFXMMU LUT entry 286 low</description>
            <addressOffset>0x18f0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT286H</name>
            <displayName>GFXMMU_LUT286H</displayName>
            <description>GFXMMU LUT entry 286 high</description>
            <addressOffset>0x18f4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT287L</name>
            <displayName>GFXMMU_LUT287L</displayName>
            <description>GFXMMU LUT entry 287 low</description>
            <addressOffset>0x18f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT287H</name>
            <displayName>GFXMMU_LUT287H</displayName>
            <description>GFXMMU LUT entry 287 high</description>
            <addressOffset>0x18fc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT288L</name>
            <displayName>GFXMMU_LUT288L</displayName>
            <description>GFXMMU LUT entry 288 low</description>
            <addressOffset>0x1900</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT288H</name>
            <displayName>GFXMMU_LUT288H</displayName>
            <description>GFXMMU LUT entry 288 high</description>
            <addressOffset>0x1904</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT289L</name>
            <displayName>GFXMMU_LUT289L</displayName>
            <description>GFXMMU LUT entry 289 low</description>
            <addressOffset>0x1908</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT289H</name>
            <displayName>GFXMMU_LUT289H</displayName>
            <description>GFXMMU LUT entry 289 high</description>
            <addressOffset>0x190c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT290L</name>
            <displayName>GFXMMU_LUT290L</displayName>
            <description>GFXMMU LUT entry 290 low</description>
            <addressOffset>0x1910</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT290H</name>
            <displayName>GFXMMU_LUT290H</displayName>
            <description>GFXMMU LUT entry 290 high</description>
            <addressOffset>0x1914</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT291L</name>
            <displayName>GFXMMU_LUT291L</displayName>
            <description>GFXMMU LUT entry 291 low</description>
            <addressOffset>0x1918</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT291H</name>
            <displayName>GFXMMU_LUT291H</displayName>
            <description>GFXMMU LUT entry 291 high</description>
            <addressOffset>0x191c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT292L</name>
            <displayName>GFXMMU_LUT292L</displayName>
            <description>GFXMMU LUT entry 292 low</description>
            <addressOffset>0x1920</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT292H</name>
            <displayName>GFXMMU_LUT292H</displayName>
            <description>GFXMMU LUT entry 292 high</description>
            <addressOffset>0x1924</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT293L</name>
            <displayName>GFXMMU_LUT293L</displayName>
            <description>GFXMMU LUT entry 293 low</description>
            <addressOffset>0x1928</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT293H</name>
            <displayName>GFXMMU_LUT293H</displayName>
            <description>GFXMMU LUT entry 293 high</description>
            <addressOffset>0x192c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT294L</name>
            <displayName>GFXMMU_LUT294L</displayName>
            <description>GFXMMU LUT entry 294 low</description>
            <addressOffset>0x1930</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT294H</name>
            <displayName>GFXMMU_LUT294H</displayName>
            <description>GFXMMU LUT entry 294 high</description>
            <addressOffset>0x1934</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
