ZigaMahne/STM32U5xx_DFP/CMSIS/SVD/STM32U5G9.svd
        <register>
          <name>MDF_DFLT5ISR</name>
          <displayName>MDF_DFLT5ISR</displayName>
          <description>This register contains the status flags for each digital filter path.</description>
          <addressOffset>0x330</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FTHF</name>
              <description>RXFIFO threshold flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that the RXFIFO threshold is not reached, writing  0  has no effect. - 1: Reading  1  means that the RXFIFO reached the threshold, writing  1  clears this flag.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVRF</name>
              <description>Data overflow flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no overflow is detected, writing  0  has no effect. - 1: Reading  1  means that an overflow is detected, writing  1  clears this flag.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSDRF</name>
              <description>Snapshot data ready flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no data is available on MDF_SNPSxDR, writing  0  has no effect. - 1: Reading  1  means that a new data is available on MDF_SNPSxDR, writing  1  clears this flag.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNEF</name>
              <description>RXFIFO Not Empty flag Set and cleared by hardware according to the RXFIFO level. - 0: Reading  0  means that the RXFIFO is empty. - 1: Reading  1  means that the RXFIFO is not empty.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OLDF</name>
              <description>Out-of Limit Detector flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no OLD event is detected, writing  0  has no effect. - 1: Reading  1  means that an OLD event is detected, writing  1  clears THHF, THLF and OLDF flags.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THLF</name>
              <description>Low threshold status flag Set by hardware, and cleared by software by writing OLDF bit to  1 . This flag indicates the status of the low threshold comparator when the last OLD event occurred. This bit gives additional information on the conditions triggering the last OLD event. It can be cleared by writing OLDF flag to    a   1. - 0: The signal was lower than OLDTHL, when the last OLD event occurred - 1: The signal was higher than OLDTHL, when the last OLD event occurred</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>THHF</name>
              <description>High threshold status flag Set by hardware, and cleared by software by writing OLDF bit to  1 . This flag indicates the status of the high threshold comparator when the last OLD event occurred. This bit gives additional information on the conditions triggering the last OLD event. It can be cleared by writing OLDF flag to    a   1. - 0: The signal was lower than OLDTHH, when the last OLD event occurred - 1: The signal was higher than OLDTHH, when the last OLD event occurred</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSOVRF</name>
              <description>Snapshot overrun flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no snapshot overrun event is detected, writing  0  has no effect. - 1: Reading  1  means that a snapshot overrun event is detected, writing  1  clears this flag.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCDF</name>
              <description>Short-Circuit Detector flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no SCD event is detected, writing  0  has no effect. - 1: Reading  1  means that a SCD event is detected, writing  1  clears this flag.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SATF</name>
              <description>Saturation detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no saturation is detected, writing  0  has no effect. - 1: Reading  1  means that a saturation is detected, writing  1  clears this flag.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKABF</name>
              <description>Clock absence detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no clock absence is detected, writing  0  has no effect. - 1: Reading  1  means that a clock absence is detected, writing  1  clears this flag.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOVRF</name>
              <description>Reshape Filter Overrun detection flag Set by hardware, and cleared by software by writing this bit to  1 . - 0: Reading  0  means that no reshape filter overrun is detected, writing  0  has no effect. - 1: Reading  1  means that reshape filter overrun is detected, writing  1  clears this flag.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_OEC0CR</name>
          <displayName>MDF_OEC0CR</displayName>
          <description>This register contains the offset compensation value.</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset error compensation Set and cleared by software. If the application attempts to write a new offset value while the previous one is not yet applied, this new offset value is ignored. Reading back the OFFSET[25:0] field will inform the application on the current offset value. OFFSET[25:0] represents the value to be subtracted to the signal before going to the SCALE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_OEC1CR</name>
          <displayName>MDF_OEC1CR</displayName>
          <description>This register contains the offset compensation value.</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset error compensation Set and cleared by software. If the application attempts to write a new offset value while the previous one is not yet applied, this new offset value is ignored. Reading back the OFFSET[25:0] field will inform the application on the current offset value. OFFSET[25:0] represents the value to be subtracted to the signal before going to the SCALE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_OEC2CR</name>
          <displayName>MDF_OEC2CR</displayName>
          <description>This register contains the offset compensation value.</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset error compensation Set and cleared by software. If the application attempts to write a new offset value while the previous one is not yet applied, this new offset value is ignored. Reading back the OFFSET[25:0] field will inform the application on the current offset value. OFFSET[25:0] represents the value to be subtracted to the signal before going to the SCALE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_OEC3CR</name>
          <displayName>MDF_OEC3CR</displayName>
          <description>This register contains the offset compensation value.</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset error compensation Set and cleared by software. If the application attempts to write a new offset value while the previous one is not yet applied, this new offset value is ignored. Reading back the OFFSET[25:0] field will inform the application on the current offset value. OFFSET[25:0] represents the value to be subtracted to the signal before going to the SCALE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_OEC4CR</name>
          <displayName>MDF_OEC4CR</displayName>
          <description>This register contains the offset compensation value.</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset error compensation Set and cleared by software. If the application attempts to write a new offset value while the previous one is not yet applied, this new offset value is ignored. Reading back the OFFSET[25:0] field will inform the application on the current offset value. OFFSET[25:0] represents the value to be subtracted to the signal before going to the SCALE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_OEC5CR</name>
          <displayName>MDF_OEC5CR</displayName>
          <description>This register contains the offset compensation value.</description>
          <addressOffset>0x334</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset error compensation Set and cleared by software. If the application attempts to write a new offset value while the previous one is not yet applied, this new offset value is ignored. Reading back the OFFSET[25:0] field will inform the application on the current offset value. OFFSET[25:0] represents the value to be subtracted to the signal before going to the SCALE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS0DR</name>
          <displayName>MDF_SNPS0DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS1DR</name>
          <displayName>MDF_SNPS1DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS2DR</name>
          <displayName>MDF_SNPS2DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS3DR</name>
          <displayName>MDF_SNPS3DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS4DR</name>
          <displayName>MDF_SNPS4DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0x2EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS5DR</name>
          <displayName>MDF_SNPS5DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0x36C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT0DR</name>
          <displayName>MDF_DFLT0DR</displayName>
          <description>This register is used to read the data processed by each digital filter.</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data processed by digital filter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT1DR</name>
          <displayName>MDF_DFLT1DR</displayName>
          <description>This register is used to read the data processed by each digital filter.</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data processed by digital filter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT2DR</name>
          <displayName>MDF_DFLT2DR</displayName>
          <description>This register is used to read the data processed by each digital filter.</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data processed by digital filter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
